from aiogram import Bot
from aiogram.enums import ParseMode
from cfg import cfg

bot = Bot(token=cfg.get("token"), parse_mode=ParseMode.HTML)

FOOD_LIST = [
    {"name": "Яблуко", "cal": 52, "weight": 100},
    {"name": "Банан", "cal": 96, "weight": 100},
    {"name": "Куряча грудка з овочами", "cal": 200, "weight": 200},
    {"name": "Броколі з сиром", "cal": 150, "weight": 150},
    {"name": "Морквяний салат з яблуком", "cal": 60, "weight": 100},
    {"name": "Лосось на грилі", "cal": 250, "weight": 150},
    {"name": "Омлет з овочами", "cal": 180, "weight": 200},
    {"name": "Грецький йогурт з медом і горіхами", "cal": 180, "weight": 150},
    {"name": "Гречка з грибами", "cal": 180, "weight": 200},
    {"name": "Вівсянка з ягодами", "cal": 150, "weight": 150},
    {"name": "Салат з кіноа і авокадо", "cal": 220, "weight": 200},
    {"name": "Малиновий смузі", "cal": 100, "weight": 200},
    {"name": "Капустяний салат", "cal": 50, "weight": 150},
    {"name": "Шпинатний салат з яйцем", "cal": 160, "weight": 200},
    {"name": "Помідорний суп", "cal": 80, "weight": 200},
    {"name": "Огірковий салат з йогуртом", "cal": 70, "weight": 150},
    {"name": "Курячий суп з овочами", "cal": 120, "weight": 250},
    {"name": "Тунець з салатом", "cal": 200, "weight": 200},
    {"name": "Салат з червоної квасолі", "cal": 190, "weight": 200},
    {"name": "Чіа пудинг з фруктами", "cal": 250, "weight": 200},
    {"name": "Мигдальне молоко з бананом", "cal": 180, "weight": 200},
    {"name": "Авокадо тост", "cal": 160, "weight": 150},
    {"name": "Солодка картопля з йогуртом", "cal": 130, "weight": 200},
    {"name": "Кіноа з овочами", "cal": 180, "weight": 200},
    {"name": "Гарбузовий суп", "cal": 100, "weight": 250},
    {"name": "Салат з буряка і сиру фета", "cal": 150, "weight": 200},
    {"name": "Персиковий десерт", "cal": 120, "weight": 150},
    {"name": "Чорничний смузі", "cal": 140, "weight": 200},
    {"name": "Апельсиновий салат", "cal": 80, "weight": 200},
    {"name": "Полуничний десерт", "cal": 110, "weight": 150},
    {"name": "Зелений чай з лимоном", "cal": 5, "weight": 250},
    {"name": "Смузі з водою і лимоном", "cal": 40, "weight": 200},
    {"name": "Салат з грейпфрутом", "cal": 90, "weight": 200},
    {"name": "Мандариновий десерт", "cal": 100, "weight": 150},
    {"name": "Часниковий хліб", "cal": 180, "weight": 100},
    {"name": "Цибулевий суп", "cal": 90, "weight": 200},
    {"name": "Селеровий салат", "cal": 50, "weight": 200},
    {"name": "Кукурудзяний салат", "cal": 120, "weight": 200},
    {"name": "Гороховий суп", "cal": 130, "weight": 250},
    {"name": "Салат з базиліком", "cal": 70, "weight": 150},
    {"name": "Петрушковий соус", "cal": 60, "weight": 100},
    {"name": "Салат з соєю і овочами", "cal": 220, "weight": 200},
    {"name": "Йогурт з ягодами", "cal": 140, "weight": 150},
    {"name": "Філе індички з картоплею", "cal": 220, "weight": 200},
    {"name": "Кефір з фруктами", "cal": 100, "weight": 200},
    {"name": "Тофу з овочами", "cal": 150, "weight": 200},
    {"name": "Чорний шоколад з горіхами", "cal": 300, "weight": 100},
    {"name": "Салат з сиром пармезан", "cal": 200, "weight": 150}
]

HEALTH_TIPS = [
    "<b>Пийте більше води:</b> Регулярне вживання води допомагає підтримувати баланс рідин у тілі, покращує обмін речовин і сприяє зниженню ваги.",
    "<b>Їжте більше овочів і фруктів:</b> Вони багаті на вітаміни, мінерали та антиоксиданти, які необхідні для здоров'я.",
    "<b>Зменшіть споживання цукру:</b> Надлишок цукру в раціоні може призвести до збільшення ваги і проблем зі здоров'ям, таких як діабет і карієс.",
    "<b>Регулярно займайтесь спортом:</b> Фізична активність допомагає спалювати калорії, покращує серцево-судинну систему і зміцнює м'язи.",
    "<b>Слідкуйте за порціями:</b> Контроль розміру порцій допомагає уникнути переїдання і підтримувати здорову вагу.",
    "<b>Вживайте білок:</b> Білок необхідний для відновлення і росту м'язів, а також забезпечує відчуття ситості.",
    "<b>Висипайтесь:</b> Достатній сон важливий для відновлення організму, підтримання енергії і зниження стресу.",
    "<b>Зменшіть стрес:</b> Стрес може призвести до переїдання і негативно впливає на загальне здоров'я. Практикуйте методи релаксації, такі як медитація, йога або прогулянки на свіжому повітрі."
]
